index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Emacs-Experience <br/> <i>The</i> <i>Path</i> <i>to</i> <i>Productivity</i></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-21 Fr"/>
<meta name="author" content="Thorsten"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Emacs-Experience <br/> <i>The</i> <i>Path</i> <i>to</i> <i>Productivity</i></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction </a></li>
<li><a href="#sec-2">2 System </a>
<ul>
<li><a href="#sec-2_1">2.1 Linux </a></li>
<li><a href="#sec-2_2">2.2 Windows </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Emacs </a>
<ul>
<li><a href="#sec-3_1">3.1 Org </a></li>
<li><a href="#sec-3_2">3.2 EShell </a></li>
<li><a href="#sec-3_3">3.3 LaTex </a></li>
<li><a href="#sec-3_4">3.4 ESS </a></li>
<li><a href="#sec-3_5">3.5 w3m </a></li>
<li><a href="#sec-3_6">3.6 Gnus </a></li>
<li><a href="#sec-3_7">3.7 Dired </a></li>
<li><a href="#sec-3_8">3.8 Ledger </a></li>
<li><a href="#sec-3_9">3.9 Calc </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Lisp </a>
<ul>
<li><a href="#sec-4_1">4.1 Elisp </a></li>
<li><a href="#sec-4_2">4.2 PicoLisp </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction </h2>
<div class="outline-text-2" id="text-1">

<p>This blog serves two purposes:
</p>
<ol>
<li><b>replace long-term memory:</b> in case I have to repeat a task later.
</li>
<li><b>share insights:</b> what took me hours, might take others only
   minutes. 
</li>
</ol>

<p>
It should document my way to Emacs-enlightment, i.e. enhanced
productivity by learning one software well instead of many
sketchily. The table of contents shows the topics I'm interested in,
and I hope there will appear more and more blog posts under the
headlines over time.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> System </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Linux </h3>
<div class="outline-text-3" id="text-2_1">

<p><a href="public-html/emacs-keyboard.html">Adapt the keyboard to Emacs keybindings (1)</a> 
</p>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Windows </h3>
<div class="outline-text-3" id="text-2_2">


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Emacs </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Org </h3>
<div class="outline-text-3" id="text-3_1">


</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> EShell </h3>
<div class="outline-text-3" id="text-3_2">


</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3">3.3</span> LaTex </h3>
<div class="outline-text-3" id="text-3_3">


</div>

</div>

<div id="outline-container-3_4" class="outline-3">
<h3 id="sec-3_4"><span class="section-number-3">3.4</span> ESS </h3>
<div class="outline-text-3" id="text-3_4">


</div>

</div>

<div id="outline-container-3_5" class="outline-3">
<h3 id="sec-3_5"><span class="section-number-3">3.5</span> w3m </h3>
<div class="outline-text-3" id="text-3_5">


</div>

</div>

<div id="outline-container-3_6" class="outline-3">
<h3 id="sec-3_6"><span class="section-number-3">3.6</span> Gnus </h3>
<div class="outline-text-3" id="text-3_6">


</div>

</div>

<div id="outline-container-3_7" class="outline-3">
<h3 id="sec-3_7"><span class="section-number-3">3.7</span> Dired </h3>
<div class="outline-text-3" id="text-3_7">


</div>

</div>

<div id="outline-container-3_8" class="outline-3">
<h3 id="sec-3_8"><span class="section-number-3">3.8</span> Ledger </h3>
<div class="outline-text-3" id="text-3_8">


</div>

</div>

<div id="outline-container-3_9" class="outline-3">
<h3 id="sec-3_9"><span class="section-number-3">3.9</span> Calc </h3>
<div class="outline-text-3" id="text-3_9">


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Lisp </h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Elisp </h3>
<div class="outline-text-3" id="text-4_1">


</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> PicoLisp </h3>
<div class="outline-text-3" id="text-4_2">







</div>
</div>
</div>
<div id="postamble">
<p class="author">Author: Thorsten</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
